In [6]:
import pandas as pd
import numpy as np

In [8]:
products_df = pd.DataFrame({
'Product_ID': [1, 2, 3],
'Product_Name': ['iPhone 12', 'Samsung S21', 'Pixel 5'],
'Product_Price': [999, 899, 699],
})
sales_df = pd.DataFrame({
'Sale_ID': [1, 2, 3, 4, 5, 6, 7],
'Sale_Date': pd.to_datetime(['2021-01-01', '2021-02-01', '2021-02-15', '2020-03-01', '2020-04-01',
'2020-02-15', '2020-01-01']),
'Customer_ID': [1, 2, 3, 2, 3, 4, 4],
'Product_ID': [1, 1, 2, 2, 3, 3, 1],
})
customers_df = pd.DataFrame({
'Customer_ID': [1, 2, 3, 4],
'Customer_Name': ['John Doe', 'Jane Doe', 'Jim Brown', 'Jake Smith'],
'Customer_Age': [25, 30, 35, 20],
'Customer_Email': ['john@doe.com', 'jane@doe.com', 'jim@brown.com', 'jake@smith.com'],
})

**Having the products_df and sales_df, merge both dataframes using 'Product_ID' as the key. Once you have it, display only the Sale_ID, Product_Name and Product_Price columns.**

In [11]:
merged_df = pd.merge(products_df, sales_df, on="Product_ID")

In [13]:
small_df = merged_df[["Sale_ID", "Product_Name", "Product_Price",]]

In [15]:
merged_df

   Product_ID Product_Name  Product_Price  Sale_ID  Sale_Date  Customer_ID
0           1    iPhone 12            999        1 2021-01-01            1
1           1    iPhone 12            999        2 2021-02-01            2
2           1    iPhone 12            999        7 2020-01-01            4
3           2  Samsung S21            899        3 2021-02-15            3
4           2  Samsung S21            899        4 2020-03-01            2
5           3      Pixel 5            699        5 2020-04-01            3
6           3      Pixel 5            699        6 2020-02-15            4

In [17]:
small_df

   Sale_ID Product_Name  Product_Price
0        1    iPhone 12            999
1        2    iPhone 12            999
2        7    iPhone 12            999
3        3  Samsung S21            899
4        4  Samsung S21            899
5        5      Pixel 5            699
6        6      Pixel 5            699

**Concatenate these dataframes with the original products_df and show the final dataframe. Use a copy() and don’t change the original products_df.**

In [20]:
apple_products_df = pd.DataFrame({
'Product_ID': [4, 5],
'Product_Name': ['iPhone 13', 'Apple Watch Series 6'],
'Product_Price': [999, 399],
})
samsung_products_df = pd.DataFrame({
'Product_ID': [6, 7],
'Product_Name': ['Samsung S22', 'Galaxy Watch 4'],
'Product_Price': [999, 250],
})

In [22]:
products_df_copy = products_df.copy()

In [24]:
products_df_copy

   Product_ID Product_Name  Product_Price
0           1    iPhone 12            999
1           2  Samsung S21            899
2           3      Pixel 5            699

In [26]:
concat_df = pd.concat([products_df, apple_products_df, samsung_products_df], axis=0)

In [28]:
concat_df

   Product_ID          Product_Name  Product_Price
0           1             iPhone 12            999
1           2           Samsung S21            899
2           3               Pixel 5            699
0           4             iPhone 13            999
1           5  Apple Watch Series 6            399
0           6           Samsung S22            999
1           7        Galaxy Watch 4            250

In [30]:
products_df

   Product_ID Product_Name  Product_Price
0           1    iPhone 12            999
1           2  Samsung S21            899
2           3      Pixel 5            699

**With the resulting df from Exercise 1, group it by Product_Name and calculate the total Product_Price.**
לא הבנתי בידיוק מה יש לחשב על מחיר המוצר

In [33]:
groupy = small_df.groupby("Product_Name")["Product_Price"].sum()

In [35]:
groupy

Product_Name
Pixel 5        1398
Samsung S21    1798
iPhone 12      2997
Name: Product_Price, dtype: int64

**In the customers_df dataframe, set 'Customer_ID' and 'Customer_Email' as indexes (multi indexing). After that, display all the customers whose ID is less than 3.**

In [38]:
customers_df

   Customer_ID Customer_Name  Customer_Age  Customer_Email
0            1      John Doe            25    john@doe.com
1            2      Jane Doe            30    jane@doe.com
2            3     Jim Brown            35   jim@brown.com
3            4    Jake Smith            20  jake@smith.com

In [40]:
customers_df.set_index(["Customer_ID", "Customer_Email"], inplace=True)

In [42]:
customers_df

                           Customer_Name  Customer_Age
Customer_ID Customer_Email
1           john@doe.com        John Doe            25
2           jane@doe.com        Jane Doe            30
3           jim@brown.com      Jim Brown            35
4           jake@smith.com    Jake Smith            20

In [44]:
customers_df[customers_df.index.isin([1,2,3], level="Customer_ID")]

                           Customer_Name  Customer_Age
Customer_ID Customer_Email
1           john@doe.com        John Doe            25
2           jane@doe.com        Jane Doe            30
3           jim@brown.com      Jim Brown            35

**Use merge, groupby, and other necessary functions to answer these questions:
a. Which customer(s) bought the most expensive product?
b. On which date did we get the highest number of sales?
c. What is the average price of the products purchased by each customer?
Remember to use multi-indexing, groupby, and date-time concepts wherever necessary.**

In [47]:
super_merge = pd.merge(products_df, sales_df, on="Product_ID")

In [49]:
super_merge = pd.merge(super_merge, customers_df, on="Customer_ID")

In [51]:
super_merge

,Product_ID,Product_Name,Product_Price,Sale_ID,Sale_Date,Customer_ID,Customer_Name,Customer_Age
0,1,iPhone 12,999,1,2021-01-01,1,John Doe,25
1,1,iPhone 12,999,2,2021-02-01,2,Jane Doe,30
2,1,iPhone 12,999,7,2020-01-01,4,Jake Smith,20
3,2,Samsung S21,899,3,2021-02-15,3,Jim Brown,35
4,2,Samsung S21,899,4,2020-03-01,2,Jane Doe,30
5,3,Pixel 5,699,5,2020-04-01,3,Jim Brown,35
6,3,Pixel 5,699,6,2020-02-15,4,Jake Smith,20

In [53]:
max_value = super_merge.groupby("Customer_Name")["Product_Price"].max().max()

In [55]:
super_merge[super_merge["Product_Price"] == max_value]["Customer_Name"]

0      John Doe
1      Jane Doe
2    Jake Smith
Name: Customer_Name, dtype: object

**b. On which date did we get the highest number of sales?** אין פה שום תאריך שמופיע פעמיים, הלכתי לפי שנתי

In [58]:
super_merge["Sale_Date"]

0   2021-01-01
1   2021-02-01
2   2020-01-01
3   2021-02-15
4   2020-03-01
5   2020-04-01
6   2020-02-15
Name: Sale_Date, dtype: datetime64[ns]

In [60]:
super_duper_merge = super_merge.copy()

In [62]:
super_duper_merge.set_index("Sale_Date", inplace=True)

In [76]:
date = super_duper_merge.resample(rule="YE")["Sale_ID"].count()
date.index[0]

Timestamp('2020-12-31 00:00:00')

**c. What is the average price of the products purchased by each customer?**

In [323]:
super_merge.groupby("Customer_Name")["Product_Price"].mean()

Customer_Name
Jake Smith    849.0
Jane Doe      949.0
Jim Brown     799.0
John Doe      999.0
Name: Product_Price, dtype: float64